# COGS 108 - Data Checkpoint

# Names

- Jake Heinlein
- Nathan Tripp
- Naomi Chin
- Leo Friedman
- Dante Tanjuatco

<a id='research_question'></a>
# Research Question

*Is the combination of an mlb free agents age and batting performance, measured by batting average and on base plus slugging percentage, indicative of their yearly salary, and if so, can an algorithm predict a players future contract based on these factors?*

# Dataset(s)

*Fill in your dataset information here*

(Copy this information for each dataset)
- Dataset Name:
- Link to the dataset:
- Number of observations:

The first data set looks at MLB players stats by year (https://www.rotowire.com/baseball/stats.php). We are using player age, batting average, and on base plus slugging percentage data. We are taking datasets from 2010-2022. From 2010-2022, the datasets contain 671, 681, 687, 685, 698, 693, 677, 675, 689, 694, 612, 734, and 772 observations, respectively. We will call the concatenation of these datasets 'batting'.

The second dataset shows free agent contracts (**insert link**), which we are using to find players yearly salary. The datasets contain... observations. We will call the concatenation of these datasets 'contracts'.

We are looking at players who are included in both sets, comparing batting performance along with age to their new contracted yearly salary as free agents.

# Setup

In [952]:
# import packages and setup visuals
import pandas as pd
import os

In [953]:
directory = 'data/contracts/'
filepaths = [directory + filename for filename in os.listdir(directory)]
contracts = pd.concat([pd.read_csv(filepath) for filepath in filepaths])
print('contracts shape: ', contracts.shape)

people = pd.read_csv('data/batting/People.csv')
batting = pd.read_csv('data/batting/Batting.csv')
print('contracts shape: ', people.shape)
print('batting shape: ', batting.shape)

contracts shape:  (4996, 18)
contracts shape:  (20370, 24)
batting shape:  (110495, 22)

# Data Cleaning

##### Part 1: Cleaning contacts dataframe

In [954]:
contracts = contracts[['Player','Pos\'n', 'Age', 'Term', 'AAV']]
contracts = contracts[contracts["Pos'n"].str.contains("hp") == False]
contracts = contracts.dropna(axis=0)
contracts = contracts.drop('Pos\'n',axis=1)
contracts

                Player   Age     Term          AAV
0       Cano, Robinson  31.0  2014-23  $24,000,000
1     Ellsbury, Jacoby  30.0  2014-20  $21,857,143
2       Choo, Shin-Soo  31.0  2014-20  $18,571,429
3        McCann, Brian  30.0  2014-18  $17,000,000
4   Granderson, Curtis  33.0  2014-17  $15,000,000
..                 ...   ...      ...          ...
66  Chisenhall, Lonnie  30.0     2019   $2,750,000
70   Maldonado, Martin  32.0     2019   $2,500,000
75       McCann, Brian  35.0     2019   $2,000,000
77      Harrison, Josh  31.0     2019   $2,000,000
78        Walker, Neil  33.0     2019   $2,000,000

[1427 rows x 4 columns]

In [955]:
def salary_to_int(str_in):
    return int(str_in.replace('$','').replace(',',''))

def term_to_year(str_in):
    return int(str(str_in).split('-')[0])

In [956]:
contracts['AAV'] = contracts['AAV'].apply(salary_to_int)
contracts['Term'] = contracts['Term'].apply(term_to_year)
contracts

                Player   Age  Term       AAV
0       Cano, Robinson  31.0  2014  24000000
1     Ellsbury, Jacoby  30.0  2014  21857143
2       Choo, Shin-Soo  31.0  2014  18571429
3        McCann, Brian  30.0  2014  17000000
4   Granderson, Curtis  33.0  2014  15000000
..                 ...   ...   ...       ...
66  Chisenhall, Lonnie  30.0  2019   2750000
70   Maldonado, Martin  32.0  2019   2500000
75       McCann, Brian  35.0  2019   2000000
77      Harrison, Josh  31.0  2019   2000000
78        Walker, Neil  33.0  2019   2000000

[1427 rows x 4 columns]

In [957]:
contracts.columns = ['playerName','playerAge','year','yearSalary']
contracts.head()

           playerName  playerAge  year  yearSalary
0      Cano, Robinson       31.0  2014    24000000
1    Ellsbury, Jacoby       30.0  2014    21857143
2      Choo, Shin-Soo       31.0  2014    18571429
3       McCann, Brian       30.0  2014    17000000
4  Granderson, Curtis       33.0  2014    15000000

##### Part 2: Clean batting dataframe

In [958]:
def calc_avg(h, ab):
    return h / ab

def calc_obp(h, bb, hbp, ab, sf):
    return (h + bb + hbp) / (ab + bb + sf + hbp)

def calc_tb(h, two_b, three_b, hr):
    singles = h - two_b - three_b - hr
    return singles + two_b * 2 + three_b * 3 + hr * 4

def calc_slg(tb, ab):
    return tb / ab

def calc_obs(obp, slg):
    return obp + slg

In [959]:
avg = calc_avg(h=batting['H'], ab=batting['AB'])
batting['AVG'] = round(avg, 3)

obp = calc_obp(h=batting['H'], bb=batting['BB'], hbp=batting['HBP'], ab=batting['AB'], sf=batting['SF'])
tb = calc_tb(h=batting['H'], two_b=batting['2B'], three_b=batting['3B'], hr=batting['HR'])
slg = calc_slg(tb, batting['AB'])
obs = calc_obs(obp, slg)
batting['OBS'] = round(obs, 3)
batting.head()

,playerID,yearID,stint,teamID,lgID,G,AB,R,H,2B,...,CS,BB,SO,IBB,HBP,SH,SF,GIDP,AVG,OBS
0,abercda01,1871,1,TRO,NaN,1,4,0,0,0,...,0.0,0,0.0,NaN,NaN,NaN,NaN,0.0,0.000,NaN
1,addybo01,1871,1,RC1,NaN,25,118,30,32,6,...,1.0,4,0.0,NaN,NaN,NaN,NaN,0.0,0.271,NaN
2,allisar01,1871,1,CL1,NaN,29,137,28,40,4,...,1.0,2,5.0,NaN,NaN,NaN,NaN,1.0,0.292,NaN
3,allisdo01,1871,1,WS3,NaN,27,133,28,44,10,...,1.0,0,2.0,NaN,NaN,NaN,NaN,0.0,0.331,NaN
4,ansonca01,1871,1,RC1,NaN,25,120,29,39,11,...,2.0,2,1.0,NaN,NaN,NaN,NaN,0.0,0.325,NaN

In [960]:
batting = batting[['playerID', 'yearID', 'AVG', 'OBS']]
batting.columns = ['playerID', 'year', 'AVG', 'OBS']
batting = batting.dropna(axis=0)
batting.head()

        playerID  year    AVG    OBS
36887  aaronha01  1954  0.280  0.769
36888   aberal01  1954  0.128  0.295
36889  abramca01  1954  0.143  0.522
36890  abramca01  1954  0.293  0.821
36891  adamsbo03  1954  0.269  0.749

In [961]:
people['name'] = people['nameFirst'] + ' ' + people['nameLast']
people = people[['playerID','name']]
batting = batting.merge(people, how='left', on='playerID')
batting = batting.rename({'name':'playerName'}, axis=1)
batting = batting[['playerID','playerName','year','AVG','OBS']]
batting.head()

    playerID   playerName  year    AVG    OBS
0  aaronha01   Hank Aaron  1954  0.280  0.769
1   aberal01      Al Aber  1954  0.128  0.295
2  abramca01   Cal Abrams  1954  0.143  0.522
3  abramca01   Cal Abrams  1954  0.293  0.821
4  adamsbo03  Bobby Adams  1954  0.269  0.749

##### Old Code: Will Delete Eventually

In [962]:
# # create functions

# # remove dollar sign and commas from salary string, convert to integer
# def salary_to_int(str_in):
#     str_in = str_in.replace('$','')
#     str_in = str_in.replace(',','')
#     output = int(str_in)
#     return output

# # turn 'LastName, FirstName' into 'FirstName LastName'
# def standardize_name(str_in):
#     # str_in = str_in.replace(',', '')
#     # str_in = remove_periods(str_in)
#     name_list = str_in.split(', ')
#     output = name_list[1] + ' ' + name_list[0]
#     return output

# # change the term length to just the starting year of the term
# def term_to_year(str_in):
#     term_list = str(str_in).split('-')
#     output = term_list[0]
#     return output

# # remove the periods from names
# def remove_periods(str_in):
#     output = str_in.replace('.','')
#     return output

In [963]:
# ## YOUR CODE HERE
# ## FEEL FREE TO ADD MULTIPLE CELLS PER SECTION

# # clean MLB contract (salary) data

# # access the directory with MLB contracts
# directory = 'data/contracts'
# # initialize list of contract filenames
# filenames = []
# # concatenate contracts from 2011-2022
# for filename in os.listdir(directory):
#     filenames.append(str(directory) + "/" + filename)
# contracts = pd.concat([pd.read_csv(f) for f in filenames])
# # keep player, position, age, term, and AAV columns
# contracts = contracts[["Player","Pos'n","Age","Term","AAV"]]
# # remove pitcher information
# contracts = contracts[contracts["Pos'n"].str.contains("hp") == False]
# # remove any rows with empty data
# contracts = contracts[contracts["AAV"].isna() == False]
# # remove $1 contracts (0 year contracts)
# contracts = contracts[contracts["AAV"] != "$1"]
# # change AAV to an integer
# contracts["AAV"] = contracts["AAV"].apply(salary_to_int)
# # reset the indices
# contracts = contracts.reset_index(drop = True)
# # rename AAV (Average Annual Value) to Yearly Salary
# contracts = contracts.rename({"AAV":"Yearly Salary"}, axis=1)
# # turn 'LastName, FirstName' into 'FirstName LastName'
# contracts["Player"] = contracts["Player"].apply(standardize_name)
# # remove all columns except for selected ones
# contracts = contracts[["Player","Term","Yearly Salary"]]
# # change the term length to just the starting year of the term
# contracts["Term"] = contracts["Term"].apply(term_to_year)
# # rename 'term_to_year' to 'Year'
# contracts = contracts.rename({"Term":"Year"}, axis = 1)
# # sort the dataframe by year
# contracts = contracts.sort_values(by="Year")
# # cleaned contract dataframe outputs
# print("The first year in the dataset is " + contracts.iloc[1,1])
# print("There are " + str(len(contracts["Player"].unique())) + " unique players in the contract data")
# display(contracts.head())

In [964]:
# # clean MLB batting data

# # access the directory with MLB batting data
# directory = 'data/batting'
# filenames = []
# dataframes = []
# # add the year of corresponding data to each dataset
# for filename in os.listdir(directory):
#     year = filename[:4]
#     filepath = str(directory) + "/" + filename
#     filenames.append(filepath)
#     df = pd.read_csv(filepath)
#     df['Year'] = year
#     dataframes.append(df)
# # concatenate 2010-2022 datasets
# batting = pd.concat(dataframes)
# # sort dataframe by year
# batting = batting.sort_values(by = "Year")
# # remove all columns except for selected ones
# batting = batting[["Player", "Pos", "Age", "AVG", "OPS", "Year"]]
# # only keep the players that also appear in the contracts dataframe
# batting = batting[batting["Player"].isin(contracts["Player"])]
# # batting["Player"] = batting["Player"].apply(remove_periods)
# # print(len(batting["Player"].unique()))
# # print((contracts[contracts["Player"].isin(batting["Player"]) == False ])["Player"])
# # for player in contracts["Player"].unique() :
# #     if((batting["Player"].unique()).contains(player) == False):
# #         print(player)
# # print(contracts["Player"].unique().isin((batting["Player"].unique())))
# # batting = batting[batting.isin(contracts["Player"])]
# batting.head()
# # batting["Player"].value_counts()